# -*- coding:utf-8 -*-
"""
列表
在python中，相比于字典，列表在python中运用的更加广泛
列表的使用方法：
ls = [] # 此处为将ls变量设置为一个空列表

将元素插入到列表中（两种方法）
ls.append(item)
# 此处的操作为将item插入列表的尾部（从尾巴处插入元素 仅仅插入元素 所有元素位置不变 仅仅延长了列表的长度）
ls.insert(item)
# 此处的操作为将item插入列表的头部（从头部插入元素 所有元素的位置+1 列表的长度也随之改变）

将列表中的元素删除（三种方法）
ls.pop(something) # 此处的操作为将something提出并在列表中删除something
关于删除列表中的元素还有另外一种删除方法 即为使用del关键字
del ls[num]
# 其中的num为整型数字
# 即 使用del关键字是将位置上的元素删除而非直接删除掉该元素
同时还有第三种方法也就是remove()
ls.remove(item)
# 此处的item为元素 即此处删除的为元素而不是删除该位置上的元素 其方法与第二种有些差异 需要注意

将列表所有值清空（三种方法）
ls。clear() # 此处的clear()函数为仅仅清空列表中的元素 长度仍为清空前的长度 没有完全清空内存
del ls[:] # 此处使用关键字del 删除的为ls从头至尾的所有元素 列表ls的长度也会随之被清空为0
# 最简单的方法就是对ls重新赋值 即
ls = []
# 此种方法也可以用于清空内存

列表中的最大值最小值（各一种方法）
max(list) # 返回列表元素最大值
min(list) # 返回列表元素最小值

获取列表的长度（一种方法）
len(ls)
# 此处使用的为len()函数来对于列表的长度进行长度计算操作 其返回值为int整型数字
"""